app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $clientes = $this->cliente_model->findAll();

SELECT *
FROM `clientes`
WHERE `id_cliente` = '3'
 LIMIT 1
---
    public function editar($id_cliente)
    {
        $cliente = $this->cliente_model->where('id_cliente', $id_cliente)->first();

UPDATE `clientes` SET `nome` = 'Helder Pereira', `data_de_nascimento` = '1989-12-17', `telefone` = '21980657337', `endereco` = 'Rua Urucuia, 570', `limite_de_credito` = '8000', `id_cliente` = '1', `updated_at` = '2025-07-14 00:56:14'
WHERE `id_cliente` = '1'
---
    public function store()
    {
        $dados = $this->request->getPost();

        if(isset($dados['id_cliente'])):
            $this->cliente_model->where('id_cliente', $dados['id_cliente'])->set($dados)->update();